Repository: 132u/smart
Catalog: TestingFiles/TM/SecondCorrectTmxEnRu.tmx
Source language: en
Languages: ru

source: Though it was winter Vadim Petrovich, the agronomist of the farm, had a busy day last Tuesday.
ru: Он был Vadim в зимний Petrovich, agronomist модуля farm, имелся A busy день последнего Tuesday.

source: He began his morning with the radio, he listened to the news.
ru: Он начал свое утро с радио, он слушал новости.Он был Vadim в зимний Petrovich, agronomist модуля farm, имелся A busy день последнего Tuesday.

source: At half past seven he got up, washed, did his morning exercises at an open window, dressed and had breakfast.
ru: В 7:30 он встал, умылся, сделал свою зарядку у открытого окна, оделся и позавтракал.Он начал свое утро с радио, он слушал новости.

source: Vadim Petrovich likes mornings, because he can see his family, and he can have a talk with his wife and children.
ru: Vadim Petrovich likes mornings, поскольку после этого он может см. его линейка и после этого он может иметь talk с его wife и детей.В 7:30 он встал, умылся, сделал свою зарядку у открытого окна, оделся и позавтракал.

source: At a quarter to nine Vadim Petrovich left home.
ru: При nine для раз в квартал Vadim Petrovich слева home.

source: It was a cold winter day.
ru: Это был холодный зимний день.

source: There was a lot of snow on the ground.
ru: В были A многих снега на земле.

source: The sky wasn't blue, and the sun didn't shine at all.
ru: Небо не голубое, а солнце не светит вовсе.

source: There weren't any people in the street.
ru: Там не было никаких людей на улице.

source: Vadim Petrovich went to the farm.
ru: Vadim Petrovich went к farm.

source: It is not far from his house, so he walks there.
ru: Это не далеко от его дома, поэтому он ходит там.

source: The road was white with snow and he couldn't walk fast.
ru: Дорога белая снег, и он не мог быстро ходить.

source: When he came to the farm, some people wanted to see and talk to him.
ru: Когда он пришел на ферму, некоторые люди хотели увидеть и поговорить с ним.

source: His working day began.
ru: Его Рабочий день начался.

source: At 1 o'clock he went home to have dinner.
ru: 13 went он. Установить ее home, чтобы dinner.

source: He had dinner with his wife and little daughter who does not go to school.
ru: Он обедал с женой и маленькой дочерью, которая не ходит в школу.

source: He ate his dinner, rested a little, and went back to the farm.
ru: Он ел свой обед, немного отдохнула и вернулась на ферму.

source: Vadim Petrovich had to talk to some people, to write some letters, and to do some other work.
ru: Vadim Petrovich имелся для talk для некоторые людей записи некоторые букв и на некоторые работы.

source: At 5 o'clock he had an important meeting.
ru: 13 went он. Установить ее home, чтобы dinner.

source: And only at 8 o'clock he came home.
ru: И только came он. Установить ее O в 20 home.И только came он. Установить ее O в 20 home.И только came он. Установить ее O в 20 home.И только came он. Установить ее O в 20 home.
